Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །ཨོཾ་ཨ་མོ་གྷ་བཛྲ་དྲྀ་ཌྷ་པདྨ་བན་དྷ་ས་མནྟེ་ན་མ་ཧཱ་ས་མནྟ་རཀྵནྟུ་མཱཾ།
en: The mantra to recite is: [91] “Oṁ, great boundary, formed around [this place] as the diamond-hard amogha lotus!

source: ཙུ་རུ་ཙུ་རུ་ཧཱུྃ་ཕཊ།
en: Protect me! Curu curu, hūṁ phaṭ! “

source: དེ་ནས་དོན་ཡོད་ཕྱག་རྒྱ་སྟེ། །གྲུབ་ལྡན་སེམས་ཅན་ཀུན་སྨྲ་ན། །དོན་ཡོད་པ་ཡི་ཕྱག་རྒྱ་ནི། །ཁྱད་པར་འཕགས་པ་གཞན་ཡང་བསྟན།
en: Now I will teach the amogha mudrā that produces accomplishments, with particular regard to bringing benefit to all sentient beings.

source: །རྡོ་རྗེ་ཐལ་མོ་སྦྱར་ནས་སོར་མོ་རྣམས་མཉམ་པར་བཞག་སྟེ།
en: The vidyā holder should form the vajrāñjali gesture, enclosing a hollow space between the palms. The fingers, aligned against each other lengthwise, should curve toward the center, and the small fingers and the thumbs should be outstretched.

source: སྲིན་ལག་ཁ་གདེངས་ལ་སོར་མོ་རྣམས་ཡིད་ཙམ་བསྐུམས་པ་ནི། དོན་ཡོད་སྣ་ཚོགས་རྒྱལ་པོ་ཡི།
en: The index fingers should be folded in.

source: །པདྨའི་ཕྱག་རྒྱ་ཆེན་པོར་བསྒྲགས།
en: This great amogha mudrā is known as the royal universal lotus.

source: །ཕྱག་རྒྱ་འདི་ནི་ལས་ཀུན་དང་། །འཇུག་པའི་ལས་ཀུན་སྦྱར་བ་དང་།
en: It is suitable for all activities and can be safely employed in any rite.

source: །དཀྱིལ་འཁོར་ཕྱག་རྒྱ་མཆོག་ཀུན་གསུངས།
en: It is said to be the best mudrā for effecting entry into any maṇḍala.

source: །ཕྱག་རྒྱ་འདི་ནི་བཟུང་ཙམ་དང་། །གསང་སྔགས་དམ་པས་བསྲུངས་བགྱིས་ནས། །རིག་སྔགས་འཆང་བ་འཇུག་པར་འགྱུར།
en: The vidyā holder will receive supreme protection if he merely displays this mudrā and recites the mantra.

source: །དུས་གསུམ་གཤེགས་པ་རྣམ་ཐར་པའི། །དཀྱིལ་འཁོར་དམ་པ་གྲུབ་པར་འགྱུར།
en: He will obtain the supreme accomplishment of the maṇḍala of liberation of the three times.

source: །ཨོཾ་བཛྲེ་བཛྲ།
en: The mantra that belongs with this mudrā is: [92] “Oṁ, vajra!

source: ཨ་དྷི་ཥྛི་ཏེ་པདྨེ་བི་ཤྭ་རཱུ་པ་དྷ་རེ།
en: Vajra-blessed lotus that assumes the universal form!

source: དྷ་ར་དྷ་ར་ཧཱུྃ།
en: Assume, assume it, hūṁ!

source: པྲ་བེ་ཤ་ཏུ་སྟྲཻ་ཡ་དྷྭཱ་ནུ་ག་ད་ན་དྷ་རི་ཏུ་ཊི་སྭཱ་ཧཱ།
en: Enter the course of the three times! Dhiri tuṭi, svāhā! “

source: ཕྱག་རྒྱ་འདི་ནི་བཅིངས་ཙམ་གྱིས། །དེ་ཉིད་གྲུབ་པས་ཕྱོགས་བཅུ་ཡི། །སངས་རྒྱས་ཞིང་ནི་རྣམ་དྲུག་ཏུ། །གཡོ་བར་འགྱུར་བ་སོམ་ཉི་མེད།
en: When this mudrā is displayed, the buddha fields in the ten directions, inhabited by those who realized the true nature, will quake six times; there is no doubt.

source: །ཕྱག་ན་པདྨའི་ལུས་འབར་ནས། །མགུ་བ་ཆེན་པོ་འབྱུང་བར་འགྱུར།
en: The body of Padmapāṇi will blaze up, and an intense joy will be felt.

source: །རིག་སྔགས་འཆང་ལ་འཛུམ་བཞིན་གྱིས། །རྟག་ཏུ་ལྟ་ཞིང་མདུན་ན་མཆིས།
en: Padmapāṇi will certainly appear to the vidyā holder with a smiling face and will stand before him.

source: །སངས་རྒྱས་ཀྱི་ནི་ཞིང་ཀུན་དང་། །མཐོ་རིས་སྒོ་རྣམས་འབྱེད་པར་འགྱུར།
en: He will open the heavenly doors to all buddha fields for him.

source: །སུམ་ཅུ་རྩ་གཉིས་གནས་རྣམས་ན། །གནས་པའི་ལྷ་རྣམས་སྒོ་འབྱེད་ཅིང་། །སུམ་ཅུ་རྩ་གསུམ་གནས་སྒོ་ན། །གནས་པ་ཐམས་ཅད་སྒོ་འབྱེད་དོ། །བདེ་ཅན་འཇིག་རྟེན་ཁམས་དག་ནི།
en: The gods of the realm of Thirty-Three will keep the doors of their realm open.

source: །སྒོ་ན་གནས་པ་སྒོ་འབྱེད་དོ།
en: All the doors to the Sukhāvatī, and all the palaces there, will be open for him as well.

source: །ཕྱག་རྒྱ་འདི་ནི་བཅིངས་ཙམ་གྱིས། །གནས་ཀུན་ཏུ་ནི་འཇུག་པར་འགྱུར།
en: He will be able to enter them as soon as he displays the mudrā. “

source: །ཕྱག་རྒྱ་སྡིག་པ་ཐམས་ཅད་འཕྲོག །ཉེ་བའི་ཉོན་མོངས་ཐམས་ཅད་འཇོམས།
en: The mudrā will remove all nonvirtue and destroy all afflictions.

source: །སྡུག་བསྔལ་ཀུན་ལས་རྣམ་པར་གྲོལ།
en: The vidyā holder will thus be free from all suffering and vice.

source: །གནོད་པ་ཐམས་ཅད་འཇིག་པར་བགྱིད། །དམྱལ་བ་བཅུ་དྲུག་རྣམས་ལས་ཐར། །ཕྱག་རྒྱ་བཅིངས་པ་ཙམ་གྱིས་ནི། །མི་བཟད་འཇིགས་པ་བརྒྱད་རྣམས་དང་།
en: He will be saved from the sixteen hells and the eight great fears.

source: །ཉེས་བྱས་ཐམས་ཅད་འཇིག་པར་བྱེད། །དམྱལ་བའི་སྒོ་ནི་གཅད་པར་འགྱུར། །མི་བཟད་འཇིགས་ལས་བསྒྲལ་བར་འགྱུར།
en: As soon as this mudrā is displayed, all his wrongdoings will be destroyed, the doors of hells will be closed, and he will be saved from fear and terror.

source: །ཕྱག་རྒྱ་འདི་ནི་མཐོང་ཙམ་གྱིས། །མཚམས་མེད་ལྔ་ནི་བགྱིས་པ་དང་། །སྡིག་པ་ཀུན་ལས་རྣམ་པར་ཐར།
en: By merely displaying this mudrā, all the wrongdoings of the vidyā holder will be purified, including the five acts of immediate retribution.

source: །སེམས་ཅན་ཀུན་ལས་རྟག་ཏུ་སྡུག །དེ་བཞིན་གཤེགས་ཀུན་བྱིན་གྱིས་རློབ།
en: He will be loved by all beings and blessed by all the tathāgatas. “

source: །ཕྱག་རྒྱ་འདི་ནི་མཐེ་བོའི་རྩེ་མོ་ཅུང་ཟད་བཀུག་ལ་བཟུང་སྟེ། གུང་མོ་པདྨའི་རལ་པའི་ཚུལ་དུ་བགྱིས་ཏེ།
en: The vidyā holder should fold the thumbs in while holding their tips, make the middle fingers into the shape of a lotus braid, and position the hands at his topknot.

source: སྤྱི་བོའི་རལ་པ་ས་ལ་བཞག་པ་ནི་པདྨའི་རལ་པའི་ཕྱག་རྒྱ་ལགས་ཏེ། འདི་ནི་དོན་ཡོད་པའི་ཞགས་པ་ཞེས་བསྒྲགས་ཏེ།
en: This is the mudrā of the lotus braid called amogha hand.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སྨན་པའི་སླད་དུ། གསང་སྔགས་འདི་བརྗོད་པར་བགྱིའོ། །ཨོཾ་ཨ་མོ་གྷ་པདྨོ་ཛ་ལེ་བི་ཤོ་དྷ་ཡ་ཧཱུྃ།
en: For the good of all beings, he should recite the mantra: [93] “Oṁ, the water of amogha lotus, purify, hūṃ!

source: བི་རི་བི་རི་བི་མ་ལེ་སྭཱ་ཧཱ།
en: Viri viri, O pure one, svāhā! “

source: ཕྱག་རྒྱ་སྤྱི་བོར་བཞག་ནས་ཆབ་བདག་གིས་བཀྲུས་ནས་གཙང་མས་གསང་སྔགས་འདི། བརྒྱ་རྩ་བརྒྱད་དུ་བཟླས་ནས་སུ།
en: Placing this mudrā at his head, the vidyā holder should perform ablutions with clean water incanted with the mantra one hundred and eight times.

source: །ཕྱག་རྒྱ་གསང་སྔགས་དོགས་མེད་པས། །རྟག་ཏུ་བཀྲུས་པའི་མོད་ཙམ་གྱིས། །མི་གཙང་བ་ནི་གཙང་བར་འགྱུར། །མི་གཙང་སྤྱོད་པ་གཙང་བ་དང་། །ཚངས་སྤྱོད་མ་ཡིན་ཚངས་སྤྱོད་འགྱུར།
en: Once the ablutions are performed, the mudrā and mantra will have the power to make the unclean clean, and the impure pure.

source: །མི་ཐུབ་པ་ནི་ཐུབ་པར་འགྱུར།
en: Vows of celibacy or silence will be mended in those who have broken them.

source: །བསོད་ནམས་ཕུང་པོ་ལྷ་བཞིན་འབར། །ཟླ་བ་ཉི་མ་བཞིན་དུ་མཛེས།
en: The vidyā holder’s heap of merit will shine as bright as the sun and the moon.

source: །འཇིག་རྟེན་ཀུན་སྙིང་རྟག་ཏུ་སྡུག །གསང་སྔགས་བླ་ན་མེད་པ་འགྲུབ། །གྲུབ་པ་དོན་ཡོད་ཞགས་པ་ཡི། །དོན་ཡོད་དེ་ཉིད་གྲུབ་པར་འགྱུར།
en: He will be loved by the whole world and will certainly win the supreme mantra accomplishment—the accomplishment of Amoghapāśa that comes from realizing the amogha nature.

source: །ལྷ་རྣམས་ཀུན་ནི་འདུ་འགྱུར་ཏེ། །བསྲུང་བའི་ཕྱིར་ནི་སོམ་ཉི་མེད།
en: All the deities will arrive to protect him; there is no doubt.

source: །མགོན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས། །སེམས་པ་མཆོག་སྦྱིན་དག་པ་པོ། །མཆོག་སྦྱིན་རྒྱུན་དུ་ཐམས་ཅད་དུ། །ཉི་མ་རེ་རེ་མཐོང་འགྱུར་ཞིང་།
en: He will certainly obtain all kinds of boons from Noble Lord Avalokiteśvara, the giver of boons to pure beings, and will see him every day.

source: །ཚེ་འཕེལ་རྟག་ཏུ་ནད་མེད་འགྱུར།
en: His lifespan will increase, and he will be forever free from ailments as he never has been before.

source: །དེ་བཞིན་མགུ་དང་རྒྱས་པར་འགྱུར།
en: He will be happy and prosperous.

source: །ཐམས་ཅད་དུ་ནི་ལས་འགྲུབ་སྟེ། །གནོད་པ་ཀུན་ལས་རྣམ་པར་གྲོལ།
en: He will be successful in every activity and free from all disease.

source: །སྡིག་པ་ཀུན་ལས་རྣམ་པར་ཐར། །ཐམས་ཅད་དུ་ནི་བཀྲ་ཤིས་མཆོག །
en: With all the obscurations cleared away, everything will be supremely auspicious.

source: ཁྲུས་ཀྱི་རྣམ་པ་འདི་དག་ནི། །དོན་ཡོད་ཁྲུས་ཀྱི་མཆོག་ཡིན་ནོ།
en: This ablution is very special; it is a supreme amogha ablution. “

source: །ལག་གཉིས་བསྡམས་ལ་འོག་ཏུ་བསྟན། །སྲིན་ལག་གཉིས་ཡུད་ཙམ་བསྐུམ་པ་ནི་པདྨའི་ནོར་བུ་ཕྱག་རྒྱ་ལགས་ཏེ།
en: Clasping his hands firmly, the vidyā holder should form the shape of the downward-pointing precious lotus.

source: །ཀུན་ནས་ཀྱང་ནི་མཉམ་པར་གཞག །
en: The index fingers should be folded in, and the other fingers surrounding them should be brought together.

source: ཕྱག་རྒྱ་ཏིང་འཛིན་ལྟ་བུ་འདི། །སྐྱིལ་མོ་ཀྲུང་བཅས་མཆིས་ནས་སུ།
en: He should sit in the cross-legged posture, as if practicing samādhi.

source: །ཕྱག་རྒྱ་འདི་དག་བཅིང་བགྱིས་ཞིང་། །མཉམ་པར་གཞག་ནས་གསང་སྔགས་བཟླས། །བཅིངས་པ་ཙམ་གྱི་མོད་ནས་ནི།
en: While displaying this mudrā, he should recite the mantra while fully focused.

source: །སྐྱིལ་ཀྲུང་རྡོ་རྗེ་ལྷུན་མཉམ་འགྱུར།
en: When this mudrā is formed, his cross-legged posture will become as stable as Mount Sumeru.

source: །ཀུན་ནས་གོ་ཆར་གྱུར་ནས་ནི། །བགེགས་དང་ལོག་འདྲེན་ཐམས་ཅད་དང་། །གནོད་སྦྱིན་སྲིན་པོ་འབྱུང་པོར་བཅས། །ལྷ་མིན་མཁའ་ལྡིང་གིས་མི་མཐོང་།
en: He will be surrounded with armor that will make him invisible to all the vighnas, vināyakas, yakṣas, rākṣasas, bhūtas, asuras, and garuḍas.

source: །ཕྱོགས་དང་ཕྱོགས་ཀྱི་མཚམས་དག་ཏུ། །དེ་དག་ཐམས་ཅད་རྒྱང་རིང་འབྲོས།
en: They will all flee far away, disappearing into the cardinal and intermediate directions.

source: །བགེགས་མེད་པར་ནི་ལས་འགྲུབ་པས། །བཟླས་པའི་ལས་ལ་སོམ་ཉི་མེད།
en: Free of obstacles, he will be able to accomplish his activities that depend on the mantra recitation; there is no doubt.

source: །ཨོཾ་ཨ་མོ་གྷ་བཛྲ་དྲྀ་ཌྷ་པདྨེ་ཤྭ་ར་ཧཱུྃ།
en: The mantra to recite with this mudrā is: [94] “Oṁ, amogha lotus lord, firm as diamond!

source: ཐལ་མོ་མཉམ་པར་སྦྱར་ལ་མཛུབ་མོ་དང་གུང་མོ་བཀུག་ནས།
en: Hūṁ! “The vidyā holder should join his hands evenly in the añjali gesture, pressing the index fingers between the palms.

source: མཐེ་བོ་པདྨ་ཁ་ཕྱེ་བ་ལྟར་བགྱིས་ཏེ།
en: The front portions of the thumbs should form the shape of an open lotus.

source: དོན་ཡོད་པའི་དབང་ཕྱུག་རྒྱལ་པོའི་ཕྱག་རྒྱའོ། །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་མདུན་དུ་གསང་སྔགས་དང་ཕྱག་རྒྱ་བཅིང་བར་བགྱིའོ།
en: This mudrā should be formed in front of Noble Avalokiteśvara while reciting the following mantra of Lord Amogharāja: [95] “Oṁ, lotus lord!

source: །ཨོཾ་པདྨེ་ཤྭ་ར་ཨ་མོ་གྷ་བར་དཱ།
en: Conferrer of amogha boons!

source: བི་རི་བི་རི་སྭཱ་ཧཱ།
en: Bhiri bhiri, svāhā! “

source: འདིས་ཐོག་མར་བཟླས་བརྗོད་ཉི་ཤུ་རྩ་གཅིག་བགྱིའོ།
en: The vidyā holder should first recite this mantra twenty-one times.

source: །དེའི་འོག་ཏུ་ཕྱག་རྒྱ་བཅིངས་ནས། དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་དེ་ཁོ་ན་ཉིད་སེམས་པའི་བསམ་པ་རྩེ་གཅིག་ཏུ་བཟླས་བརྗོད་བགྱིའོ།
en: Then, forming the mudrā, he should recite the heart mantra of Amoghapāśa with one-pointed concentration, immersed in its reality.

source: །ལན་ཅིག་བཟླས་པ་ཙམ་གྱི་མོད་ལ།
en: If the mantra is repeated mindfully just one time, the earth will quake.

source: དུས་གསུམ་དུ་རྒྱུན་དུ་གཤེགས་པའི་སངས་རྒྱས་འབུམ་ཕྲག་བརྒྱ་སྟོང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དང་མཉམ་པ་གཡོ་བར་འགྱུར་ཞིང་། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས། རིག་སྔགས་འཆང་དེ་ལ་ལེགས་སོ་ཞེས་བགྱི་བ་སྩོལ་བར་འགྱུར་རོ། །དབུགས་འབྱིན་པར་མཛད་དོ།
en: Hundreds of thousands of millions of buddhas of the three times—the tathāgatas, the worthy, fully realized buddhas equaling the grains of sand in the Gaṅgā river—will applaud the vidyā holder and give him comfort.

source: །རིག་སྔགས་འཆང་དེ་ལ་འོད་ཟེར་སྣ་ཚོགས་གཏོང་བར་མཛད་དོ།
en: They will bathe him in multicolored light.

source: །མགོན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དྲན་པར་བགྱིས་པ་ཙམ་གྱི་མོད་ལ་མདུན་དུ་མཆིས་པར་འགྱུར་རོ།
en: Noble Lord Avalokiteśvara will appear before him as soon as he thinks of him. “

source: །འདི་ལྟར་བཅིངས་པ་ཙམ་གྱིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: By merely displaying this mudrā, the vidyā holder will master the six perfections.

source: །ཕ་རོལ་ཏུ་ཕྱིན་པ་བཅུ་དང་ལྡན་པར་འགྱུར་རོ། །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་དང་ལྡན་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་ལྡན་པར་འགྱུར་རོ།
en: He will become fully endowed with the ten perfections, the eighteen unique qualities of a buddha, and the ten strengths of a tathāgata.

source: །མི་འཇིགས་པ་བཞི་ཐོབ་པར་འགྱུར་རོ།
en: He will also obtain the four types of fearlessness.

source: །འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་ཡོངས་སུ་དག་པ་ཐོབ་པར་འགྱུར་རོ།
en: His practice of the noble eightfold path will be completely pure.

source: །ཕྱག་རྒྱ་འདི་བཅིངས་ལ་དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་དྲན་པར་བགྱིས་པ་ཙམ་གྱི་མོད་ལ། ཡོན་ཏན་དང་ཕན་ཡོན་རྣམས་འཐོབ་པར་འགྱུར་རོ།
en: As soon as he forms this mudrā and recollects the heart mantra of Amogharāja, the vidyā holder will obtain great qualities and benefits. “

source: །བཟླས་བརྗོད་བརྒྱ་རྩ་བརྒྱད་བཅངས་ནས། ཞག་གཅིག་སྨྱུང་བ་བགྱིས་ཏེ་བཟླས་བརྗོད་བགྱིས་ན། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བདག་ཉིད་ཀྱི་རང་བཞིན་དུ་མདུན་ན་མཆིས་ནས། རིག་སྔགས་འཆང་ལ་ལེགས་སོ་ཞེས་བགྱི་བ་སྩོལ་ཏེ།
en: If the vidyā holder performs a ritual fast for one day while reciting the mantra one hundred and eight times and displaying the mudrā as many times, Noble Avalokiteśvara will appear before him in person, in his true form, and will applaud him, saying, ‘Good!

source: རིག་སྔགས་འཆང་ལེགས་སོ་ལེགས་སོ། །འདི་ནི་བཟླས་བརྗོད་ཀྱི་དམ་པ་ཡིན་ནོ།
en: It is good, vidyā holder, that you have performed this supreme recitation!’

source: །ཞེས་དཔུང་པ་གཡས་པ་བརྐྱང་བའི་ལག་པས་རིག་སྔགས་འཆང་གི་སྤྱི་བོར་བཞག་ནས། དབུགས་འབྱིན་པར་མཛད་དེ་ཚུར་ཤོག་བུ་གང་འདོད་པའི་མཆོག་སློངས་ཤིག་དང་སྦྱིན་ནོ།
en: He will then extend his right arm, place his hand on the vidyā holder’s head, and encourage him, saying, ‘Come, son, I will grant you magical boons, the best that you may wish for!

source: །ཁྱོད་རྗེས་སུ་བཟུང་ཞིང་བྱིན་གྱིས་བརླབས་པས་ངའི་བུ་རིག་སྔགས་འཆང་གི་ཐུ་བོར་གྱུར་ཅིག །
en: Accept them and become, through my blessing, my eldest vidyādhara-son.

source: རིག་སྔགས་འཆང་ཁྱོད་ཀྱིས་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་གྲུབ་པས། རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་གྱི་ཕྱག་རྒྱ་རིམ་པར་དབྱེ་བ་དང་།
en: You have accomplished a maṇḍala of liberation that is the essence of Amoghapāśa.

source: ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་ལ་བརྟན་པར་གྱིས་ཤིག །
en: You should steadfastly uphold this sovereign rite that involves his mudrā.

source: སྙིང་རྗེ་ཆེན་པོའི་སེམས་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ལ་གོམས་པར་གྱིས་ཤིག །
en: May your thoughts be suffused with great compassion for all beings.

source: ཁྱོད་འདི་ནས་མ་འོངས་པའི་མངལ་དུ་གནས་ནས། ཤི་འཕོས་ཏེ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་འགྲོ་བར་འགྱུར་ཞིང་། ཁྱོད་པདྨའི་ནང་དུ་རྫུས་ཏེ་སྐྱེས་ནས།
en: This is your last birth from a womb; when you die you will go to the realm of Sukhāvatī, where you will be spontaneously born from a lotus flower.

source: རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་ཅིང་མཚན་དང་དཔེ་བྱད་ཀྱིས་རབ་ཏུ་བརྒྱན་པ།
en: You will be adorned with every ornament and graced with the major and minor marks of perfection.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་མཐར་ཐུག་གི་བར་དུ་ཚེ་དཔག་ཏུ་མེད་པར་འགྱུར་རོ།
en: Your lifespan will be inexhaustible, continuing until you finally ascend the seat of ultimate awakening.’ “

source: །འདི་ལྟར་ཚིག་གཞན་མི་སྨྲ་བར་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ཏེ། ཕྱག་རྒྱ་བརྒྱ་རྩ་བརྒྱད་བཅིངས་པས། ལན་སྟོང་རྩ་བརྒྱད་ཚང་ནས་ནམ་མཁའ་ལ་མཆི་བར་འགྱུར་རོ།
en: If the vidyā holder recites the mantra one thousand and eight times and displays the mudrā one hundred and eight times without engaging in other talk, he will ascend through space after the one thousand and eight recitations are complete.

source: །དོན་ཡོད་པའི་རྣམ་པར་འཕྲུལ་པ་རྣམ་པར་དག་པའི་དཀྱིལ་འཁོར་གྱི་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་རོ། །རིག་སྔགས་འཆང་འབུམ་ཕྲག་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་བཅྭ་བརྒྱད་ཀྱིས་ཡོངས་སུ་བསྐོར་བར་འགྱུར་རོ། །ཚེ་དཔག་ཏུ་མ་མཆིས་པར་འགྱུར་རོ།
en: He will become a wheel-turning monarch in the magically created, pure amogha maṇḍala, where his lifespan will be infinite and he will be attended upon by a retinue of eighteen hundreds of thousands of millions of billions of vidyādharas.

source: །དོན་ཡོད་རྒྱ་ཆེར་སྣང་བ་ཞེས་བགྱི་བའི་རྫུ་འ་ཕྲུལ་འཐོབ་པར་འགྱུར་རོ། །རྫུ་འཕྲུལ་གང་གི་མཐུས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་དཔུང་པ་བསྐུམ་པ་ལས་བརྐྱང་བ་ཙམ་གྱིས་མཆི་ཞིང་སླར་ལྡོག་པར་འགྱུར།
en: He will obtain the magical power called the great and wide amogha splendor, whereby he will be able to visit any realm in the great trichiliocosm in the time it takes to extend and contract one’s arm. “

source: བཟླས་བརྗོད་བརྒྱ་སྟོང་བགྱིས་ལ་ཕྱག་རྒྱ་བརྒྱ་སྟོང་བཅིངས་ན། ཚེ་འདི་ཉིད་ལ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་འདྲ་བར་འགྱུར་རོ།
en: If the vidyā holder recites the mantra one hundred thousand times and displays the mudrā as many times, he will become like Noble Avalokiteśvara in this very life.

source: །སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་གྱིས་རྣམ་པར་རོལ་པའི་དོན་ཡོད་པའི་མིག་ཡོངས་སུ་དག་པ་འཐོབ་པར་འགྱུར་རོ། །དབང་ཕྱུག་དང་དབང་ཕྱུག་ཆེན་པོ་དང་། ཚངས་པ་དང་། ལྷའི་བུ་དང་། དྲག་པོ་དང་། དབང་པོ་དང་། ཉི་མ་དང་།
en: Transformed through the samādhi of the illusory nature of phenomena, he will obtain the completely pure, divine amogha vision.

source: ཟླ་བ་དང་། གཞོན་ནུ་དང་། གཤིན་རྗེ་དང་། ཆུ་ལྷ་དང་། ལུས་ངན་ལ་སོགས་པའི་གཟུགས་སྣ་ཚོགས་མཐོང་བར་འགྱུར་རོ།
en: He will thus be able to see gods such as Īśvara, Maheśvara, and Brahmā, and also Rudra, Vāsava, Soma, Āditya, Kumāra, Yama, Varuṇa, Kubera, and so forth, up to and including the different nāga kings with their various forms.

source: །ཀླུའི་རྒྱལ་པོའི་གཟུགས་རྣམ་པ་སྣ་ཚོགས་ཀྱི་བར་དུ་མཐོང་བར་འགྱུར་རོ། །ཇི་ལྟ་ཇི་ལྟར་སེམས་ཅན་རྣམས་འདུལ་བར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟ་བུའི་གཟུགས་མཐོང་བར་འགྱུར་ཏེ།
en: He will see the forms of different beings according to their level of development.

source: འདི་ནི་འཇིག་རྟེན་པའི་བཟླས་བརྗོད་སྒྲུབ་པ་འབུམ་ལགས་སོ།
en: This worldly sādhana requires one hundred thousand repetitions of the mantra.

source: །འབུམ་བཟླས་པས་འཇིག་རྟེན་ལས་འདས་པ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ན། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མངོན་སུམ་དུ་སྣང་བའང་མཐོང་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་ལུང་བསྟན་པ་འཐོབ་པར་འགྱུར་རོ།
en: If the vidyā holder recites the mantra one hundred thousand times as part of a transcendent sādhana, he will be able to see, face-to-face, all the tathāgatas in all the buddha fields in the ten directions.

source: །བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ཐུག་གི་བར་དུ་ཕྱིར་མི་ལྡོག་པར་བྱིན་གྱིས་རླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ།
en: He will obtain a prophecy of his own future awakening from each of them, and he will be established on the level from which he will not turn back until ultimate awakening is attained. “

source: །ཕྱག་རྒྱ་བཅིངས་ཏེ་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས།
en: The vidyā holder should sit in the cross-legged posture and form the mudrā.

source: སེམས་ཅན་ཐམས་ཅད་ལ་བརྩེ་བ་དང་། འབྱུང་པོ་ཐམས་ཅད་ལ་བྱམས་པ་དང་། སྙིང་རྗེའི་སེམས་ཀྱི་རང་བཞིན་གྱིས་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ལན་ཅིག་བཟླས་བརྗོད་བགྱིའོ།
en: Assuming an attitude of kindness, love, and compassion for all sentient beings, he should recite the heart mantra of Amoghapāśa a single time.

source: །བཟླས་བརྗོད་བགྱིས་མ་ཐག་ཁོ་ནར་ལན་དྲུག་བརྒྱ་བཞི་བཅུར་བཟླས་བརྗོད་བགྱིས་པར་འགྱུར་རོ།
en: If this recitation is done in combination with the mudrā, it will be the same as reciting the mantra eighty-eight times.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དབུགས་འབྱིན་པ་མཛད་ཅིང་དྲན་པ་དང་། བློ་གྲོས་དང་། གཟི་བརྗིད་ལུས་ལ་འཇུག་པར་བགྱིད་དོ།
en: He will receive comfort from all the tathāgatas, who will grant him intelligence and good memory and will charge his body with energy.

source: །བཟླས་བརྗོད་བགྱིས་པ་ཙམ་གྱི་མོད་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: By reciting only the words of the mantra, he will accomplish the six perfections.

source: །རི་མོའི་སྐུ་གཟུགས་དེ་ལ་ཡང་འོད་ཟེར་འབྱུང་བར་འགྱུར་རོ།
en: Rays of light will issue forth from the form of Noble Avalokiteśvara in the painting. “

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཡོངས་སུ་དག་པའི་བདག་ཉིད་རྨི་ལམ་དུ་མཐོང་བར་འགྱུར་རོ། །མཆོག་ཐམས་ཅད་སྩོལ་བར་འགྱུར་རོ།
en: When the vidyā holder is asleep, Noble Avalokiteśvara will appear to him in his pure body and grant him every boon as requested.

source: །དེའི་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ཡོངས་སུ་དག་པར་འགྱུར་རོ།
en: All the vidyā holder’s karmic obscurations will be completely purified.

source: །སྡིག་པ་དང་སྒྲིབ་པ་ཐམས་ཅད་ཡོངས་སུ་བསལ་བ་དང་། གཏུགས་པར་འགྱུར་རོ།
en: The obscurations caused by his wrongdoings will diminish and completely go away.

source: །ནད་ཐམས་ཅད་སྤངས་པར་འགྱུར་རོ།
en: All his diseases will end.

source: །འཇིག་རྟེན་པའི་དགོས་པ་སྒྲུབ་པ་རྣམས་ཀྱི་དམ་པ་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་བས་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་བསྒོམ་པར་བགྱིའོ།། །།འཕགས་པ་དོན་ཡོད་པའི་ཞགས་པའི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ།
en: The practices undertaken to fulfill worldly duties will be fully accomplished.

source: བམ་པོ་གསུམ་པ།
en: He should continually maintain the recollection of the Buddha. “

source: ཐལ་མོ་ལྷན་ཅིག་བསྡམས་ཏེ་སྦྱར་ལ།
en: The vidyā holder should join his hands firmly, aligning them in the añjali gesture.

source: རྩེ་མོ་ཡིད་ཙམ་བཀུག་སྟེ་བར་གཏད་ལ་སྲིན་ལག་གཉིས་ཕྱིར་འགྱེད་ཅིང་།
en: The tips of the fingers should be slightly bent and held at the level of the mouth.

source: གུང་མོ་པདྨ་ལྟ་བུར་བགྱིས་ཏེ།
en: The little and the middle fingers should be positioned to resemble an open lotus.

source: སྔགས་འདི་བརྗོད་དོ།
en: The mantra to recite is: [96] “Oṁ, turu turu!

source: །ཨོཾ་ཏུ་རུ་ཏུ་རུ་པདྨེ་ཨ་མོ་གྷ་སིད་དྷི་ཧཱུྃ།
en: The lotus-related amogha accomplishment, hūṁ! “

source: ཕྱག་རྒྱ་འདི་ནི་དོན་ཡོད་འགྲུབ།
en: This is the mudrā of amogha accomplishment.

source: །ལས་རྣམས་གྲུབ་དང་ལྡན་པ་ཡི།
en: It brings success in all activities.

source: །འདི་ནི་བཅིང་བ་བགྱིས་པ་ཡིས། །ཀུན་རིག་མྱུར་དུ་འགྲུབ་པར་འགྱུར། །མྱུར་དུ་སྟོན་པ་སྩོལ་འགྱུར་ཏེ།
en: When this mudrā is displayed, the vidyā holder will swiftly attain omniscience.

source: རྙེད་དཀའ་དོན་ཡོད་གྲུབ་པ་མཆོག །མཆོག་ཀུན་རབ་ཏུ་སྟོབས་པར་འགྱུར། །འཇིག་རྟེན་འདས་པ་དེ་བཞིན་འཇིག་རྟེན་པ།
en: Amoghapāśa will appear to him and grant him the amogha accomplishment that is difficult to obtain, as well as every boon, both mundane and supramundane.

source: །སྒྲིབ་པ་ཐམས་ཅད་ལས་ནི་རྣམ་པར་གྲོལ། །བསོད་ནམས་ཕུང་པོ་དག་ནི་རྟག་ཏུ་འཕེལ། །བཀྲ་ཤིས་སྒྲ་ནི་འབྱུང་བར་འགྱུར་བའོ། །ལྷ་རྣམས་རྟག་ཏུ་བསྲུང་བར་འགྱུར།
en: He will be freed from all his wrongdoings, his store of merit will ever increase, his speech will confer happiness, and he will always be protected by the devas. “

source: །རྡོ་རྗེ་བཅིངས་པ་ཤིན་ཏུ་བཅིང་། །རྟག་ཏུ་སེམས་ནི་བརྟན་པོར་བགྱི།
en: The vidyā holder should carefully form a vajra knot while maintaining a firm and steady mind.

source: །མཛུབ་མོ་དག་ནི་ཡིད་བསྐུམས་ནས། །སྙིང་པོ་དག་ནི་རབ་ཏུ་བརྐྱང་།
en: He should place the knot at the heart, with the index fingers folded in.

source: །དོན་ཡོད་པའི་པདྨའི་དཀྱིལ་འཁོར་ཕྱག་རྒྱ་དང་། སྙིང་པོ་གསུངས་པ་དང་།
en: This mudrā, called amogha lotus, is the heart essence of the lotus maṇḍala.

source: པདྨའི་དབང་ཕྱུག་གི་ཕྱག་རྒྱ་ལས་དང་དོན་ཐམས་ཅད་འགྲུབ་པའི་གསང་སྔགས་དེ་དག་ཐམས་ཅད་གསུངས་ནས།
en: It is the mudrā of the lotus lord that fulfills the aims of all activities.

source: དེ་ནས་དོན་ཡོད་པའི་རྒྱལ་པོ་གསུངས་པ།
en: It should be formed while first reciting the following mantra and then the mantra of Amogharāja. [

source: ཨོཾ་ཨ་མོ་གྷ་ཧྲྀ་ད་ཡ།
en: 97] “Oṁ, the lotus with an amogha heart essence!

source: པདྨེ་དྷ་ར་དྷ་ར་པདྨ་དྷ་ར་མ་ཧཱ་མཎྜ་ལ་ཧྲྀ་ད་ཡ་ཧཱུྃ།
en: Hold it, hold, O lotus holder! The essence of the great maṇḍala, hūṁ! “

source: སྙིང་པོ་ཕྱག་རྒྱ་འདི་ནི་བཅིངས་པ་ཡིས། །པདྨ་འཆང་བའི་དོན་ཡོད་སྙིང་པོ་ཡི།
en: This mudrā activates the heart essence of the lotus holder.

source: །གྲུབ་པ་དེ་ཉིད་ཡང་དག་སོམ་ཉི་མེད།
en: It effectively actualizes the amogha essence as it really is; there is no doubt about this.

source: །ཐམས་ཅད་དུ་ནི་ལས་རྣམས་ཐམས་ཅད་དག །དེ་ནི་གྲུབ་པར་འགྱུར་ཏེ་སོམ་ཉི་མེད།
en: It accomplishes, without a doubt, all activities in every way.

source: །ཤིན་ཏུ་གསང་བའི་ཕྱག་རྒྱ་གཟུང་། །ཤིན་ཏུ་གསང་བའི་གསང་སྔགས་བཟླས།
en: The vidyā holder should display this mudrā in secret and recite the mantra in utter secrecy.

source: །ཤིན་ཏུ་བཀྲུ་བས་གོས་གཙང་གྱོན། །གཙང་མའི་སེམས་ཀྱིས་འཆང་བགྱིད་ཅིང་། །སེམས་ཅན་ཀུན་ལ་བརྩེ་གྱུར་ནས། །རྟག་ཏུ་བླ་མ་གུས་པར་བསྒོམ། །རྟག་ཏུ་ཤིན་ཏུ་དང་བགྱི་ཞིང་།
en: He should be well washed, wear clean clothes, have pure thoughts, feel compassion for all beings, and have devotion for his master.

source: །པདྨའི་ཕྱག་ལ་དགའ་བར་བགྱི།
en: With complete faith, he should always delight in the worship of Padmapāṇi.

source: །མྱུར་དུ་ལས་འགྲུབ་མྱུར་དུ་ནི། །པདྨ་འཆང་དང་སངས་རྒྱས་འགྲུབ།
en: He will swiftly accomplish the activities and attain buddhahood.

source: །མྱུར་དུ་འཇིག་རྟེན་དབང་ཕྱུག་འཐོབ། །མྱུར་དུ་སེམས་ཅན་ཀུན་ཕན་ལྡན།
en: He will swiftly become a lokeśvara and will have the capacity to benefit all beings. “

source: །ལག་པ་གཡོན་པ་བརྐྱང་བ་ཙམ་གྱིས་ཁར་པདྨའི་ཚུལ་དུ་བཞག་ལ་ལག་པ་བསྒྱུར་ནས།
en: The vidyā holder should extend his left arm, keeping it at the level of his mouth, and form his hand into the shape of a lotus with the ring finger pointing upward and the thumb bent.
